src/Documents/СписаниеЗапасов/СписаниеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="63fc9824-0dd1-4e3b-bce6-34e0806fc11f">
  <name>СписаниеЗапасов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="7a5d8d18-0c19-43fa-bd17-fb0829399f40">
    <name>Корреспонденция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8973b446-32e8-45d2-b667-bf42ff14672b">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9d7ed395-6ef8-49bc-bebd-2d54a90a461e">
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c4db935-35d7-4d62-8a15-618510684083">
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="54061a7b-b591-4e85-b8ee-bfdb8a04099c">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="67b6e352-219a-42c9-931c-6f33a50e1679">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3f18c47c-1d09-4f5c-90c7-9b0178f328ab">
    <name>АктСписанияЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="488a4386-edea-4bbe-aea7-c1f074074e0f">
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d571c8f2-7145-4602-8d9b-3d5460b5a3aa">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4beade32-981f-4d93-a378-832af113ece5">
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ff77278b-74dd-4091-b8c6-474e3b55cc34">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8387c882-9c3b-4423-9257-f87acf821d14">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1cf9a850-eb3b-4efe-a28c-a84845c641f2">
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b3e3587f-2cd6-491d-b8e7-21b37895c9cc">
      <name>СерийныеНомера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d0da806d-734b-4d28-ac48-c24d83a34c87">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="287cac5a-735f-49a8-a00d-e7a53ad15dcd">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>am_Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>am_Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="49c4fd20-9868-483b-b488-8c57fd046bdc">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="0d19eb74-bf6e-4116-86fe-df31d53de608">
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="9bbb1a13-6b20-4404-9200-e9443b24ff4a">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e610b9a6-c6a5-4365-bd2e-749d31a6932a">
    <name>Актуальность</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="60782cbe-1ea8-49b3-8d12-06b63e48f302">
    <name>ВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a28e04ee-8fae-48f0-b7c4-e031134c920f">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d003232-5e09-4e5c-94f9-008a3b9c38e0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/СписаниеЗапасов/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура am_ЗапасыПриИзмененииПосле(Элемент)
	ТекДанные = ЭтаФорма.Элементы.Запасы.ТекущиеДанные;
	ТекДанные.am_Цена = ПолучитьЦенуНоменклатуры(ТекДанные.Номенклатура);
	
	Если ТекДанные.am_Цена <> 0 Тогда
		ТекДанные.am_Сумма = ТекДанные.Количество * ТекДанные.am_Цена;
	Иначе
		ТекДанные.am_Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуНоменклатуры(НоменклатураСсылка)
        
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
        |   ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
        |ИЗ
        |   РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
        |ГДЕ
        |   ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
    
    Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка); 
    
    РезультатЗапроса = Запрос.Выполнить();
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Если ВыборкаДетальныеЗаписи.Следующий() Тогда
         Возврат ВыборкаДетальныеЗаписи.Цена;
    Иначе
         Возврат 0;
    КонецЕсли;
      
КонецФункции
